In [1]:
#import library 
import pandas as pd
import numpy as np

In [14]:
# data
cuisine = pd.read_csv('chefmozcuisine.csv') 
user_cuisine = pd.read_csv('usercuisine.csv')
user_payment = pd.read_csv('userpayment.csv')

In [10]:
cuisine.head()

   placeID        Rcuisine
0   135110         Spanish
1   135109         Italian
2   135107  Latin_American
3   135106         Mexican
4   135105       Fast_Food

In [23]:
user_cuisine.head()

  userID          Rcuisine
0  U1001          American
1  U1002           Mexican
2  U1003           Mexican
3  U1004            Bakery
4  U1004  Breakfast-Brunch

In [15]:
user_payment.head()

  userID          Upayment
0  U1001              cash
1  U1002              cash
2  U1003              cash
3  U1004              cash
4  U1004  bank_debit_cards

# Merging on a specific column

In [9]:
# merge_by_rcuisine on 'Rcuisine 
merge_by_rcuisine = pd.merge(cuisine , user_cuisine , on = 'Rcuisine')
merge_by_rcuisine.head()

   placeID Rcuisine userID
0   135110  Spanish  U1060
1   135110  Spanish  U1135
2   132770  Spanish  U1060
3   132770  Spanish  U1135
4   132273  Spanish  U1060

# Merging on columns with non-matching labels

In [25]:
# use left and right 
combined = pd.merge(user_payment , user_cuisine , left_on= 'userID' , right_on = 'userID')
combined

    userID Upayment           Rcuisine
0    U1001     cash           American
1    U1002     cash            Mexican
2    U1003     cash            Mexican
3    U1004     cash             Bakery
4    U1004     cash   Breakfast-Brunch
..     ...      ...                ...
406  U1135     cash           Southern
407  U1135     cash  Dessert-Ice_Cream
408  U1136     cash            Mexican
409  U1137     cash            Mexican
410  U1138     cash           Pizzeria

[411 rows x 3 columns]

# Left & right merging on multiple columns

In [ ]:
# Merge sales and managers: sales_and_managers
# use how choose left

sales_and_managers = pd.merge(sales , managers , how= 'left' , left_on= ['city', 'state'] ,right_on=['branch', 'state'] )

# Merge order

In [ ]:
# Perform the first ordered merge: tx_weather
tx_weather = pd.merge_ordered(austin,houston)

In [ ]:
merge_asof()